<?php
class Pet{
	public $name;
	public $type = 'unknown';
	
	function __construct($name, $type){
		$this->name = $name;
		$this->type = $type;
		//echo "вызов ".__METHOD__." для ".$this->name."<br>";
	}
	
	function __destruct(){
		echo 'Обьект удален!!<br>';
	}
	
	function __clone(){
		echo 'Обьект клонирован';
	}
	
	public function say($word){
		echo $this->name ." сказал ".$word;
	}
		
	function methodName(){
		echo "<p>Вызван метод ".__METHOD__;
	}
}

$cat = new Pet('Мурзик', 'Кот');
$dog = new Pet('Тузик', 'Пес');
$bird = clone $cat;

echo $cat->name;
echo '<br>';
echo $dog->name;
echo '<br>';
$cat->say('Мяу');
echo '<br>';
$dog->say('Гав');
echo '<br>';
//$dog->methodName();


//методы класса описывают поведение обьектов

// Конструктор -метод который ВЫЗЫВАЕТСЯ при создании обьекта (.т.е конструктор - это обычная функция ктороая запускается автоматически)
// Для того чтобы автоматизировать что-либо при создании обьекта класса используется конструктор - __construct
// Обычно конструктор используется для инициализации св-тв 
//Конструктор по умолчанию имеет имя класса (это можно не писать и не нужно писать)

//Диструктор - спец метод при удалении обьекта (че-то длеает перед удалением обьекта)
// В деструктор нельзя передать параметры

//Обьекты передаются только по ссылке !!! т.е копия обьекта не создается оператором = , копия обьекта создается оператором clone
//При клонировании конструктор НЕ ВЫЗЫВАЕТСЯ
//Если надо чтобы при клонировании обьекта что-то произошло, то в классе описываем метод __clone()
//в метод __clone() передать ничего нельзя


